#include <stdio.h>
#include <stdlib.h>
#include <unistd.h>
#include <string.h>
#include <math.h>
#include <sys/socket.h>
#include <netinet/in.h>
#include <arpa/inet.h>
#include <sys/select.h>

#define PORT 8888
#define BUFFER_SIZE 1024

typedef unsigned char u8;

static const u8 sbox[256] = {
    0x63,0x7c,0x77,0x7b,0xf2,0x6b,0x6f,0xc5,0x30,0x01,0x67,0x2b,0xfe,0xd7,0xab,0x76,
    0xca,0x82,0xc9,0x7d,0xfa,0x59,0x47,0xf0,0xad,0xd4,0xa2,0xaf,0x9c,0xa4,0x72,0xc0,
    0xb7,0xfd,0x93,0x26,0x36,0x3f,0xf7,0xcc,0x34,0xa5,0xe5,0xf1,0x71,0xd8,0x31,0x15,
    0x04,0xc7,0x23,0xc3,0x18,0x96,0x05,0x9a,0x07,0x12,0x80,0xe2,0xeb,0x27,0xb2,0x75,
    0x09,0x83,0x2c,0x1a,0x1b,0x6e,0x5a,0xa0,0x52,0x3b,0xd6,0xb3,0x29,0xe3,0x2f,0x84,
    0x53,0xd1,0x00,0xed,0x20,0xfc,0xb1,0x5b,0x6a,0xcb,0xbe,0x39,0x4a,0x4c,0x58,0xcf,
    0xd0,0xef,0xaa,0xfb,0x43,0x4d,0x33,0x85,0x45,0xf9,0x02,0x7f,0x50,0x3c,0x9f,0xa8,
    0x51,0xa3,0x40,0x8f,0x92,0x9d,0x38,0xf5,0xbc,0xb6,0xda,0x21,0x10,0xff,0xf3,0xd2,
    0xcd,0x0c,0x13,0xec,0x5f,0x97,0x44,0x17,0xc4,0xa7,0x7e,0x3d,0x64,0x5d,0x19,0x73,
    0x60,0x81,0x4f,0xdc,0x22,0x2a,0x90,0x88,0x46,0xee,0xb8,0x14,0xde,0x5e,0x0b,0xdb,
    0xe0,0x32,0x3a,0x0a,0x49,0x06,0x24,0x5c,0xc2,0xd3,0xac,0x62,0x91,0x95,0xe4,0x79,
    0xe7,0xc8,0x37,0x6d,0x8d,0xd5,0x4e,0xa9,0x6c,0x56,0xf4,0xea,0x65,0x7a,0xae,0x08,
    0xba,0x78,0x25,0x2e,0x1c,0xa6,0xb4,0xc6,0xe8,0xdd,0x74,0x1f,0x4b,0xbd,0x8b,0x8a,
    0x70,0x3e,0xb5,0x66,0x48,0x03,0xf6,0x0e,0x61,0x35,0x57,0xb9,0x86,0xc1,0x1d,0x9e,
    0xe1,0xf8,0x98,0x11,0x69,0xd9,0x8e,0x94,0x9b,0x1e,0x87,0xe9,0xce,0x55,0x28,0xdf,
    0x8c,0xa1,0x89,0x0d,0xbf,0xe6,0x42,0x68,0x41,0x99,0x2d,0x0f,0xb0,0x54,0xbb,0x16
};

static const u8 inv_sbox[256] = {
    0x52,0x09,0x6a,0xd5,0x30,0x36,0xa5,0x38,0xbf,0x40,0xa3,0x9e,0x81,0xf3,0xd7,0xfb,
    0x7c,0xe3,0x39,0x82,0x9b,0x2f,0xff,0x87,0x34,0x8e,0x43,0x44,0xc4,0xde,0xe9,0xcb,
    0x54,0x7b,0x94,0x32,0xa6,0xc2,0x23,0x3d,0xee,0x4c,0x95,0x0b,0x42,0xfa,0xc3,0x4e,
    0x08,0x2e,0xa1,0x66,0x28,0xd9,0x24,0xb2,0x76,0x5b,0xa2,0x49,0x6d,0x8b,0xd1,0x25,
    0x72,0xf8,0xf6,0x64,0x86,0x68,0x98,0x16,0xd4,0xa4,0x5c,0xcc,0x5d,0x65,0xb6,0x92,
    0x6c,0x70,0x48,0x50,0xfd,0xed,0xb9,0xda,0x5e,0x15,0x46,0x57,0xa7,0x8d,0x9d,0x84,
    0x90,0xd8,0xab,0x00,0x8c,0xbc,0xd3,0x0a,0xf7,0xe4,0x58,0x05,0xb8,0xb3,0x45,0x06,
    0xd0,0x2c,0x1e,0x8f,0xca,0x3f,0x0f,0x02,0xc1,0xaf,0xbd,0x03,0x01,0x13,0x8a,0x6b,
    0x3a,0x91,0x11,0x41,0x4f,0x67,0xdc,0xea,0x97,0xf2,0xcf,0xce,0xf0,0xb4,0xe6,0x73,
    0x96,0xac,0x74,0x22,0xe7,0xad,0x35,0x85,0xe2,0xf9,0x37,0xe8,0x1c,0x75,0xdf,0x6e,
    0x47,0xf1,0x1a,0x71,0x1d,0x29,0xc5,0x89,0x6f,0xb7,0x62,0x0e,0xaa,0x18,0xbe,0x1b,
    0xfc,0x56,0x3e,0x4b,0xc6,0xd2,0x79,0x20,0x9a,0xdb,0xc0,0xfe,0x78,0xcd,0x5a,0xf4,
    0x1f,0xdd,0xa8,0x33,0x88,0x07,0xc7,0x31,0xb1,0x12,0x10,0x59,0x27,0x80,0xec,0x5f,
    0x60,0x51,0x7f,0xa9,0x19,0xb5,0x4a,0x0d,0x2d,0xe5,0x7a,0x9f,0x93,0xc9,0x9c,0xef,
    0xa0,0xe0,0x3b,0x4d,0xae,0x2a,0xf5,0xb0,0xc8,0xeb,0xbb,0x3c,0x83,0x53,0x99,0x61,
    0x17,0x2b,0x04,0x7e,0xba,0x77,0xd6,0x26,0xe1,0x69,0x14,0x63,0x55,0x21,0x0c,0x7d
};

static const u8 Rcon[11] = {0x00,0x01,0x02,0x04,0x08,0x10,0x20,0x40,0x80,0x1b,0x36};
/*
это таблица раундовых контант для AES-128 (Round CONstans)

это массив из 11 байт который используеться в развертке ключа aes-init
каждый элемент это константа для определенного соответствующего раунда

каждое значение это удвоение предыдущего в поле галуа GF(2^8) с редукцией по полиному AES (0x11b)
то есть когда результат выходит за 8 бит, делаеться XOR с 0x1b - это редукция по модулю полинома AES

без Rcon разные раундовые ключи могли бы получиться одинаковыми или повторяться цикличчески
Rcon как раз разрушает симметрию и каждый раунд получаеться уникальная константа
это делает развертку ключа нелинейной и защищает от атак связаных с симетрией

AES-128 требует 10 раундов + начальный ключ
то есть с Rcon[1] по Rcon[10], а Rcon[0] это просто чтобы было удобно при i/16

для других версий было бы другое количество раундов и констант соответственно
    Версия      Раундов Констант
    AES-128	    10	    11
    AES-192	    12	    13
    AES-256	    14	    15
*/

static u8 round_keys[176];
/*
обьявление глобального массива из 176 байт, где будут храниться все раундовые ключи для AES-128

AES-128 использует 11 раундовых ключей по 16 байт
    11 * 16 = 176 байт
*/

static u8 xtime(u8 x){
    return (x << 1) ^ ((x >> 7) * 0x1b);
}
/*
функция умножения в поле галуа GF(2^8) - обычная операция в AES

x << 1
    сдвиг влево на 1 -> умножение на 2
    все биты пеезжают влево а справа дописываеться 0
    но если старший бит был 1 то они вылетают за пределы поэтому нужно взять по модую полинома AES

x >> 7
    сдвиг вправо на 7 -> берем только старший бит 1 или 0

(x >> 7) * 0x1b
    если старший бит был 0 то ничего не делаем
    если старший бит был 1 то 1 * 0x1b -> XOR с 0x1b

^
    это просто XOR -> соборка всего вместе
    если старший бит 0 то просто сдвиг
    если старший бит 1 то сдвиг + модуль
*/

static u8 gmul(u8 a, u8 b){
    u8 p = 0;

    for(int i = 0; i < 8; i++){
        if(b & 1){
            p ^= a;
        }

        u8 hi = a & 0x80;

        a<<=1;

        if(hi){
            a ^= 0x1b;
        }

        b >>= 1;
    }

    return p;
}
/*
Функция умножения двух байтов в поле Галуа GF(2^8)

чтобы умножить нужно сделать сдвиг влево
если старший бит не 0 а 1 то делаеться не просто сдвиг с потерей
а XOR с 0x1bб ничего не теряя

*/

void aes_init(const u8 *key){
    memcpy(round_keys, key, 16);

    for(int i = 16; i < 176; i += 4){
        u8 t[4];

        memcpy(t, round_keys + i - 4, 4);

        if(i % 16 == 0){
            u8 tmp = t[0];

            t[0] = sbox[t[1]] ^ Rcon[i / 16];
            t[1] = sbox[t[2]];
            t[2] = sbox[t[3]];
            t[3] = sbox[tmp];
        }

        for(int j = 0; j < 4; j++){
            round_keys[i + j] = round_keys[i - 16 + j] ^ t[j];
        }
    }
}
/*
aes_init() - это развертка (key expansion)
из 16-байтового ключа AES-128 генерирует 176 байт раундовых ключей (11 ключей <-> 16 байт)

всего нужно 44 слова (44 * 4 = 176 байт)
каждое новое слово w[i] вычисляеться из предыдущего w[i - 1] и слова w[i - 4]
    w[i] = w[i - 4] XOR w[i - 1]

но каждое 4-е слово w[4] w[8] w[12] ...
проходит через специальное преобразование чтобы ключи не повторялись

memcpy() 
    копируем первые 16 байт мастер-ключа в начало масива round_keys - это 4 начальных слова - w[0] w[1] w[2] w[3]

for(int i = 16; i < 176; i += 4)
    идем по массиву шагами по 4 байта (по одному слову)
    начинаем с байта 16

    на каждой итерации мы вычисляем новое слово из 4-х байт

u8 t[4]
memcpy(t, round_keys + i - 4, 4)
    берем предыдущее слово w[i - 1] в буфер t

    round_keys + i - 4 -> указатель на предыдущее слово (4 байта назад)

if(i % 16 == 0)
    проверяем - это четвертое слово?

    если i % 16 == 0
        то слово начинает новый раунд и его нужно специально преобразовать

    иначе - просто xor с предыдущим словом раунда назад

а дальше просто преобразовагние слова - три операции в одной
*/

static void add_round_key(u8 *s, int r){
    for(int i = 0; i < 16; i++){
        s[i] ^= round_keys[r * 16 + i];
    }
}
/*
Делает xor с раундовым ключом (16 байт)

u8 *s - указатель на состояние (16 байт), которое изменеться на месте
int r - номер раунда - от 0 до 10

идет по всем байтам состояния и делает xor с каждым из соответствующего байта раундово ключа
раундовые ключи лежат в массиве round_keys[176] подряд
формула -> r * 16 * i <- вычисляет смещение нужного байта ключа

это единственная операция AES, где используеться ключ
без нее шифр был бы полностью публичным и любой мог бы расшифровать данные 
xor с ключом делает результат завимимым от сервета

xor это обратная сама себе операция поэтому можно делать эту операцию в две стороны (и для расшифрвоания),
однако ключи применяються в обратном порядке
*/

static void sub_bytes(u8 *s){
    for(int i = 0; i < 16; i++){
        s[i] = sbox[s[i]];
    }
}
/*
заменяет каждый байт состояния по таблице s-box

u8 *s - указатель на состояние

для каждого из 16 байтов нужно взять го значение от 0 до 255 и использовать как индекс в таблице sbox[256]
и записать значение обратно

это Нелинейная операция AES 
без нее шифр был бы линейным и его можно было бы взломать решив систему линейных уравнений

используеться на каждом раунде шифрование перед shift_rows()
в финальном раунде тоже применяеться
*/

static void inv_sub_bytes(u8 *s){
    for(int i = 0; i < 16; i++){
        s[i] = inv_sbox[s[i]];
    }
}
/*
заменяет каждый байт состояния по обратной таблице inv-s-box

u8 *s - указатель на состояние

тоже самое что и sub_bytes(), но испольуеться таблица inv_sbox[256]
это та же операция но с таблицей, обратной sbox

при расшифровывании отменяет замену сделанную sub_bytes()
без нее нельзя восстановить исходные байты
конечно, можно было бы просто каждый раз искать нужное значение в sbox перебором но это, естественно, будет занимать кучу времени
поэтому заранее построена обратная таблица 
*/

static void shift_rows(u8 *s){
    u8 t;

    t = s[1];  s[1]  = s[5];  s[5]  = s[9];  s[9]  = s[13]; s[13] = t;
    t = s[2];  s[2]  = s[10];                               s[10] = t;
    t = s[6];  s[6]  = s[14];                               s[14] = t;
    t = s[15]; s[15] = s[11]; s[11] = s[7];  s[7]  = s[3];  s[3]  = t;
    
}
/*
циклически сдвигает строки матрицы 4x4 влево, перемешивая байты между столбцами

состояние это матрица 4x4, однако в коде она храниться как линейный массив из 16-ти байт и они уложены по столбцам
                столбец 0   столбец 1   столбец 2   столбец 3
    строка 0    s[0]        s[4]        s[8]        s[12]
    строка 1    s[1]        s[5]        s[9]        s[13]
    строка 2    s[2]        s[6]        s[10]       s[14]
    строка 3    s[3]        s[7]        s[11]       s[15]

эта функция сдвигает каждвую строку влево на ее номер
    ну то есть нулевая строка не меняеться
    первая сдвигаеться на 1 : [a,b,c,d] -> [b,c,d,a]
    вторая на 2             : [a,b,c,d] -> [c,d,a,b]
    ну и третья на 3        : [a,b,c,d] -> [d,a,b,c]

все это нужно для диффузии
эта функция переешиваеть байты между столбцами и после этого mix_columns() будет работать уже с байтами из разных столбцов

в AES три операции работают в связке
    sub_bytes() - нелинейнолсть
    shift_rows() - перемешивает байты между столбцами
    mix_columns() - перемешивает уже внутри столбца

    только вместе они создают сильную диффузию

*/

static void inv_shift_rows(u8 *s){
    u8 t;

    t = s[13]; s[13] = s[9];  s[9]  = s[5];  s[5]  = s[1];  s[1]  = t;
    t = s[2];  s[2]  = s[10];                               s[10] = t;
    t = s[6];  s[6]  = s[14];                               s[14] = t;
    t = s[3];  s[3]  = s[7];  s[7]  = s[11]; s[11] = s[15]; s[15] = t;
}
/*
циклически сдвигает строки матрицы 4x4 вправо, отменяя shift_rows

фактически исполняет тоже самое но только сдвигает вправо
какая по счету строка на столько и сдвигает 
*/

static void mix_columns(u8 *s){
    for(int c = 0; c < 4; c++){
        u8 *col = s + 4 * c;

        u8 a0 = col[0], a1 = col[1], a2 = col[2], a3 = col[3];

        col[0] = xtime(a0) ^ (xtime(a1) ^ a1) ^ a2 ^ a3;
        col[1] = a0 ^ xtime(a1) ^ (xtime(a2) ^ a2) ^ a3;
        col[2] = a0 ^ a1 ^ xtime(a2) ^ (xtime(a3) ^ a3);
        col[3] = (xtime(a0) ^ a0) ^ a1 ^ a2 ^ xtime(a3);
    }
}
/*
умножает каждый столбец на фиксированную матрицу в gf(2^8), перемешивая байты внутри столбца

каждый столбец преобразуеться независимо от других

здесь происходит умножение на фиксированную матрицу 4x4,
где сложение и умножение происходит в поле Галуа GF(2^8)
    сложение -> XOR
    умножение -> xtime/gmul

в числах:
    col[0] = 2·a0 + 3·a1 + 1·a2 + 1·a3
    col[1] = 1·a0 + 2·a1 + 3·a2 + 1·a3
    col[2] = 1·a0 + 1·a1 + 2·a2 + 3·a3
    col[3] = 3·a0 + 1·a1 + 1·a2 + 2·a3

for(int c = 0; c < 4; c++){ u8 *col = s + 4 * c; }
    s + 4 * c       указатель на начало c-го столбца
    столбец 0       s[0...3], столбец 1 -> s[4...7], и так далее

матрица [2,3,1,1]
        [1,2,3,1]
        [1,1,2,3]
        [3,1,1,2]
эта матрица специально подобрана так чтобы
    была обратимой в GF(2^8)
    имела хорошие свойства диффузии (каждый входной байт влияет на все 4 выходных)
    имела максимальное расстояние между входом и выходом

все это защищает от дифференциальногг криптоанализа:
    изменение одного байта на входе меняет 4 байта на выходе

а обратная функция созданна для расшифровки и там нужно умножить уже на обратную матрицу
*/

static void inv_mix_columns(u8 *s){
    for(int c = 0; c < 4; c++){
        u8 *col = s + 4 * c;

        u8 a0=col[0], a1=col[1], a2=col[2], a3=col[3];

        col[0] = gmul(a0,14) ^ gmul(a1,11) ^ gmul(a2,13) ^ gmul(a3,9);
        col[1] = gmul(a0,9)  ^ gmul(a1,14) ^ gmul(a2,11) ^ gmul(a3,13);
        col[2] = gmul(a0,13) ^ gmul(a1,9)  ^ gmul(a2,14) ^ gmul(a3,11);
        col[3] = gmul(a0,11) ^ gmul(a1,13) ^ gmul(a2,9)  ^ gmul(a3,14);
    }
}
/*
умножает каждый столбец на обратную матрицу в gf(2^8), отменяя mix_colomns

отменяет перемешивание байтов внутри столбца, чтобы восстановить исходные байты

при шифровании mix_columns() умножал столбец на матрицу
    [2,3,1,1]
    [1,2,3,1]
    [1,1,2,3]
    [3,1,1,2]

    чтобы отменить это, нужно умножить на обратную матрицу
    [14,11,13,9]
    [9,14,11,13]
    [13,9,14,11]
    [11,13,9,14]

for(int c = 0; c < 4; c++){u8 *col = s + 4 * c;}
    s + 4 * c       указатель на начало c-го столбца
    столбец 0       s[0...3], столбец 1 -> s[4...7], и так далее
    
u8 a0=col[0], a1=col[1], a2=col[2], a3=col[3];
    сохраняем исходные байты столбца в переменные a0, a1, a2, a3
    чтобы потом использовать их для вычисления новых значений столбца

col[0] = gmul(a0,14) ^ gmul(a1,11) ^ gmul(a2,13) ^ gmul(a3,9);
    вычисляем новый байт столбца col[0] как линейную комбинацию исходных байтов a0, a1, a2, a3
    с коэффициентами 14, 11, 13, 9 в поле Галуа GF(2^8)
    gmul(a,b) - это умножение в поле Галуа GF(2^8)
    ^ - это XOR (сложение в поле Галуа GF(2^8))
все это нужно для того чтобы отменить перемешивание байтов внутри столбца, чтобы восстановить исходные байты

при расшифровании надо вернуть байты, перемешанные с помощью mix_columns(), обратно на место, 
иначе inv_shift_rows() и inv_sub_bytes() получат не те байты и все сломаеться

при расшифровке порядок операций другой:
    inv_shift_rows() -> inv_sub_bytes() -> add_round_key() -> inv_mix_columns()

    inv_mix_columns() идет сразу после add_round_key() потому что при шифровании mix_columns() был перед add_round_key() 
    чтобы размотать эту цепочку нужно пойти с конца

мне понравился пример нейронки когда она мне давала пример с красками:
    mix_columns() -> смешать краски в пропорцияз 2:3:1:1
    inv_mix_columns() -> смешать краски в пропорциях 14:11:13:9 чтобы получить исходные цвета
    это как обратный рецепт смешивания красок

без inv_mix_columns() расшифровка не будет работать и мы не сможем восстановить исходные байты после add_round_key() и inv_shift_rows() и inv_sub_bytes()
*/

void aes_encrypt_block(const u8 *plain, u8 *cipher){
    u8 s[16];

    memcpy(s, plain, 16);
    add_round_key(s, 0);

    for(int r = 1; r < 10; r++){
        sub_bytes(s);
        shift_rows(s);
        mix_columns(s);
        add_round_key(s, r);
    }

    sub_bytes(s);
    shift_rows(s);
    add_round_key(s, 10);
    memcpy(cipher, s, 16);
}
/*
шифрует один блок - выполняет начальный add_round_key(), 
затем 9 полных раундов (sub_bytes() -> shift_rows() -> mix_columns() -> add_round_key()) и финальный 10-й раунд без mix_columns()

выполняет начальный раунд + 9 полных раундов + финальный раунд и всего 10 раундов шифрования AES-128

это основная функция шифрования одного блока AES-128

локальный буффер состояния
    u8 s[16];
    memcpy(s, plain, 16);

    создаем массив s[16] - это состояние (state) в AES-128
    копируем туда открытый текст
    работаем с копией чтобы не портить входной буффек plain

начальный add_round_key(s, 0)
    XOR состояния с нулевым раундовым ключом (первыми 16 байтами round_keys[176])
    это не считаеться раундом так как это просто начальное наложение ключа

    оно нужно чтобы с самого начала данные были перемешаны с ключом
    без этого первый раунд работал бы с чистым открытым текстом, что ослабляет шифрование

девять полных раундов 
    for(int r = 1; r < 10; r++){
        sub_bytes(s);
        shift_rows(s);
        mix_columns(s);
        add_round_key(s, r);
    }

    каждый раунд состоит из 4 операций:
        sub_bytes() - заменяет байты по таблице sbox
        shift_rows() - сдвигает строки состояния влево
        mix_columns() - перемешивает байты внутри столбцов
        add_round_key(s, r) - XOR с раундовым ключом

    порядок нельзя менять - он обеспечивает правильную комбинацию нелинейности и диффузии
    всего будет 9 раундо а не 10 так как финальный 10-й раунд отличаеться от остальных

финальный 10-й раунд
    sub_bytes(s);
    shift_rows(s);
    add_round_key(s, 10);

    финальный раунд делает три операции вместо четырех
        sub_bytes() - ✓
        shift_rows() - ✓
        mix_columns() - ✗ (пропуск)
        add_round_key() - ✓

    почему без mix_columns() ?
        симметрия с расшифрованием
            если в последнем раунде нет mix_columns(), то в первом раунде расшифрования не нужен inv_mix_columns() - упрощает код
        никакой потери стойкости
            mix_columns() не добавляет новых свойств, которых еще не дали предыдущие 9 раундов и после 9 раундов данные уже достаточно перемешанны
        экономия
            меньше операций - меньше времени на шифрование и меньше кода

memcpy(cipher, s, 16);
    копируем зашифрованный блок из состояния в выходной буффер cipher

sub_bytes() первым
    Неллинейность должна применяться до линейных операций, чтобы сделать всю конструкцию нелинейной
    Если бы sub_bytes() был последним, линейные операции шли бы подряд и могли бы «сократиться»

shift_rows() и mix_columns() вместе
    shift_rows() перемешивает между строками
    mix_columns() перемешивает внутри столбца
    Вместе они создают полную диффузию: 
        изменение одного байта → через 2 раунда меняются все 16 байт

add_round_key() в конце раунда
    XOR с ключом делается после перемешивания
    Это гарантирует, что ключ влияет на уже перемешанные данные, 
    и его нельзя «вынести за скобки» через линейную алгебру

Финальный раунд без mix_columns()
    Это стандартное решение FIPS-197
    Позволяет расшифрованию начинаться с add_round_key() + inv_shift_rows() + inv_sub_bytes() без inv_mix_columns() — проще и быстрее

без этого порядка AES потеряет стойкость или вообще перестанет быть обратимым
порядок операций в AES тщательно продуман и проверен криптографами, поэтому его нельзя менять без потери безопасности
все это часть стандарта AES-128 (FIPS-197) и должна выполняться в точности как описано в стандарте, иначе шифрование и расшифровка не будут работать корректно 
*/

void aes_decrypt_block(){
    memcpy();
    add_round_key();

    for(int r = 1; i < 10; i++){
        inv_shift_rows();
        inv_sub_bytes();
        add_round_key();
        inv_mix_columns();
    }

    inv_shift_rows();
    inv_sub_bytes();
    add_round_key();
    memcpy();
}
/*
расшифровывает один блок, выполняя те же операции в обратном порядке с обратными функциями (inv_shift_rows() -> inv_sub_bytes() -> inv_mix_columns()) и ключами от последнемо к первому
*/

void aes_encrypt_message(){

}
/*
шифрует сообщение любой длинны, дополняя до 16 байт по PKCS#7 и шифрует каждый блок через aes_encrypt_block()
*/

void aes_decrypt_message(){
    
}
/*
расшифровывает сообщение - каждый блок через aes_decrypt_block() и убирает PKCS#7 дополнение
*/

void set_rgb_color(int r, int g, int b){
    printf("\033[38;2;%d;%d;%dm", r, g, b);
}

void rainbow_text_smooth(const char *text){
    int length = strlen(text);

    for(int i = 0; i < length; i++){
        float p = (float)i / length;

        int r = (int)(sin(p * 2 * M_PI + 0) * 127 + 128);
        int g = (int)(sin(p * 2 * M_PI + 2 * M_PI / 3) * 127 + 128);
        int b = (int)(sin(p * 2 * M_PI + 4 * M_PI / 3) * 127 + 128);

        set_rgb_color(r, g, b);
        printf("%c", text[i]);

    }

    printf("\033[0m");
}

int main(void){
    u8 key[16] = {
        0x00,0x01,0x02,0x03,0x04,0x05,0x06,0x07,
        0x08,0x09,0x0A,0x0B,0x0C,0x0D,0x0E,0x0F
    };

    aes_init(key);

    int client_fd;
    struct sockaddr_in server_addr;
    char buffer[BUFFER_SIZE] = {0};

    if((client_fd = socket(AF_INET, SOCK_STREAM, 0)) < 0){
        rainbow_text_smooth("socket invalid\n");
        return -1;
    }

    server_addr.sin_family = AF_INET;
    server_addr.sin_port = htons(PORT);

    if(inet_pton(AF_INET, "127.0.0.1", &server_addr.sin_addr) <= 0){
        rainbow_text_smooth("invalid address\n");
        return -1;
    }

    if(connect(client_fd, (struct sockaddr*)&server_addr, sizeof(server_addr)) < 0){
        rainbow_text_smooth("invalid connect\n");
        return -1;
    }

    rainbow_text_smooth("connect\n");

    while(1){
        fd_set readfds;
        FD_ZERO(&readfds);
        FD_SET(client_fd, &readfds);
        FD_SET(0, &readfds);

        select(client_fd + 1, &readfds, NULL, NULL, NULL);

        if(FD_ISSET(0, &readfds)){
            fgets(buffer, BUFFER_SIZE, stdin);
            buffer[strcspn(buffer, "\n")] = 0;

            u8 encrypted[BUFFER_SIZE];
            size_t enc_len;

            aes_encrypt_message(buffer, encrypted, &enc_len);

            uint32_t len_net = htonl(enc_len);
            send(client_fd, &len_net, 4, 0);
            send(client_fd, encrypted, enc_len, 0);
        }

        if(FD_ISSET(client_fd, &readfds)){
            uint32_t len_net;
            int bytes = recv(client_fd, &len_net, 4, 0);

            if(bytes <= 0){
                rainbow_text_smooth("server disconnected\n");
                break;
            }

            size_t enc_len = ntohl(len_net);

            if(enc_len > BUFFER_SIZE){
                enc_len = BUFFER_SIZE;
            }

            u8 encrypted[BUFFER_SIZE];
            bytes = recv(client_fd, encrypted, enc_len, 0);

            if(bytes <= 0){
                break;
            }

            char decrypted[BUFFER_SIZE];

            aes_decrypt_message(encrypted, enc_len, decrypted);

            rainbow_text_smooth(decrypted);
            printf("\n");
        }

    }

    close(client_fd);
    return 0;
}